/*----------------------------------------------------------------------------------
두수 a,b에 대한 절대값을 반환하는 함수
------------------------------------------------------------------------------------*/
function getAbs(a,b){
    //두수를 대상으로 절대값을 구하는 식
    return Math.abs(a-b);   //함수를 호출한 실행부가 결과를 가지고 호출한 곳으로 되돌아감
}

/*----------------------------------------------------------------------------------
랜덤 구하는 함수
n을 넣으면, 0~n까지 포함하여 랜덤한 수를 반환하는 함수
------------------------------------------------------------------------------------*/
function getRandom(n){
    var r = Math.random();            //1보다 작은 실수 0.0xxx ~ 0.9xxx
    return Math.floor((n+1) * r);    //소수점을 버린다
}

/*----------------------------------------------------------------------------------
랜덤 구하는 함수 II
ex) 7과 23사이의 랜덤값을 반환 (a=7(min), b=23(max))
------------------------------------------------------------------------------------*/
function getRandomBetween(min, max){
    //최소값 이상은 무조건 확보되어야 한다 즉, 반환되어야 한다 ((최대-최소)+min)
    //return Math.floor((max-min+1)*math.random())+min;
    return getRandom(max-min) + min;
}

/*----------------------------------------------------------------------------------
숫자에 0을 붙인 날짜처리
매개변수, 즉 인수로 수를 전달하면 함수 내에서 알아서 0을 붙여줌
(두자리 한자리 판단마저도 여기서 알아서 해준다)
------------------------------------------------------------------------------------*/
function getZeroDate(n){    
    if(n<10){       //n이 10보다 작으면 0을 접두어로 붙이자
        n="0"+n;
    }
    return n;
}


